app/controllers/requests_controller.rb

  def index
    @requests = Request.where(:status => "open").where("media_url IS NOT NULL").order("requested_datetime DESC")
---
SELECT "requests".* FROM "requests" WHERE "requests"."status" = 'open' AND (media_url IS NOT NULL) ORDER BY requested_datetime DESC

  def show
    @request = Request.find(params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "10"]]

  def remote_post
    request = Request.find(params[:id])
    user = User.find(cookies[:user_id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]