app/controllers/user_controller.rb

  def login
    require 'open-uri'
    require 'json'
    url = ENV['tr_url'] || APP_CONFIG['taskrabbit'][:url]

    result = JSON.parse(open( url + "/api/v1/account?access_token=" + params[:access_token]).read)
    remote_info = {}
    result.each do |r|
      remote_info[r[0]] = r[1]
    end

    user = User.find_or_initialize_by_remote_id(remote_info['id'])
    user.update_attributes(
      :remote_id      => remote_info['id'],
      :display_name   => remote_info['display_name'],
      :token          => params[:access_token]
    )
---
SELECT "users".* FROM "users" WHERE "users"."remote_id" = 4 LIMIT 1
UPDATE "users" SET "token" = 'BkW9ZheIwKrx56v419rG2OfSqu2wePJhrx6hBdjy', "updated_at" = '2012-04-20 18:55:30.903623' WHERE "users"."id" = 1